EA/src/DataProcessors/ОбработкаДефектуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаДефектуры</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>табСклады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>табПоставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>табТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабГруппыЗакупки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаЗакупки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппаЗакупки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабКонцернов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Концерн</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Концерны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабПроизводители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Вендор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

EA/src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипГруппы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыГруппНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛекарственнаяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛекарственныеФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дозировка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дозировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фасовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фасовки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МНН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МНН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рецептурный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖизненноВажный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наркотический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Холод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Психотропный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяГруппаЗакупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыЗакупкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНаСайте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеБываетВДоставке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВАптеке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяЗакупка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрендПроизводителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрендыПроизводителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодОКП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрендТМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрендыТМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокПодЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаКраткая</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаПолная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговоеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вендор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйАналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФонетическийКодПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйСрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭксклюзивныйПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Концерн</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Концерны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФонетическийКодСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗСЯ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стеллаж</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗонаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/DataProcessors/ОбработкаДефектуры/Forms/ФормаПоискаАналогаТовара/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтрокаПоиска = "";
	Параметры.Свойство("ИскомыйТовар", СтрокаПоиска); 
	Если ПустаяСтрока(СтрокаПоиска) Тогда

		Отказ = Истина;
		Возврат;

	КонецЕсли; 
	
	НаименованиеТовара = СокрЛП(СтрокаПоиска);
	СтрокаПоиска = НаименованиеТовара;
	ТоварВыбран = Ложь;

КонецПроцедуры

&НаСервере
Функция НайтиТоварыСервере(СтрокаПоиск)

	ТабТоваров.Очистить();

	ТаблицаПоиска = Новый ТаблицаЗначений;
	ТаблицаПоиска.Колонки.Добавить("NumWord",			Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПоиска.Колонки.Добавить("mLikeWord",			Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100,ДопустимаяДлина.Переменная)));
	ТаблицаПоиска.Колонки.Добавить("LikeWordМаска",		Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100,ДопустимаяДлина.Переменная)));
	ТаблицаПоиска.Колонки.Добавить("mLikeWordМаска",	Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100,ДопустимаяДлина.Переменная)));
	
	ИскомаяФраза = СокрЛП(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрокаПоиск, Символ(160), " "), "+", " "), "+", " "), "/", " "), "\", " "), ",", " "), ".", ""), "  ", " "), "  ", " "));
	стрИскомаяФраза = СтрЗаменить(ИскомаяФраза, " ", Символы.ПС);
	Если ПустаяСтрока(стрИскомаяФраза) Тогда
		Возврат Неопределено; 
	КонецЕсли;

	локКолСлов = ?(ПустаяСтрока(стрИскомаяФраза),0, СтрЧислоСтрок(стрИскомаяФраза));
	Если ПустаяСтрока(стрИскомаяФраза) Тогда
		Возврат Неопределено;
	Иначе
		
		Для СчСлов = 1 По СтрЧислоСтрок(стрИскомаяФраза) Цикл
			
			Слово = ВРЕГ(СтрПолучитьСтроку(стрИскомаяФраза, СчСлов));
			СловоФонетическийКод = справочники.Номенклатура.ПолучитьФонетическийКод(Слово);
			Если ЗначениеЗаполнено(СловоФонетическийКод) и СтрДлина(СловоФонетическийКод) > 3 тогда
				НоваяСтрока 				= ТаблицаПоиска.Добавить();
				НоваяСтрока.NumWord 		= СчСлов;	
				НоваяСтрока.mLikeWord 		= СловоФонетическийКод;
				НоваяСтрока.LikeWordМаска 	=  "%" + Слово + "%";
				НоваяСтрока.mLikeWordМаска 	= "%" + СловоФонетическийКод + "%";
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	КоличествоСлов = ТаблицаПоиска.Количество();
	Если КоличествоСлов = 0 тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Слова.NumWord,
	|	Слова.mLikeWord,
	|	Слова.LikeWordМаска,
	|	Слова.mLikeWordМаска
	|ПОМЕСТИТЬ Слова
	|ИЗ
	|	&ТЗ КАК Слова
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Слова.NumWord,
	|	Слова.mLikeWord,
	|	Слова.LikeWordМаска,
	|	Слова.mLikeWordМаска
	|ПОМЕСТИТЬ втСловаСЗаполненнымФонетическимКодом
	|ИЗ
	|	Слова КАК Слова
	|ГДЕ
	|	Слова.mLikeWord <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втСловаСЗаполненнымФонетическимКодом.NumWord) КАК NumWord
	|ПОМЕСТИТЬ втНайденныеБезМНН
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСловаСЗаполненнымФонетическимКодом КАК втСловаСЗаполненнымФонетическимКодом
	|		ПО (Номенклатура.ФонетическийКодПолноеНаименование ПОДОБНО втСловаСЗаполненнымФонетическимКодом.mLikeWordМаска)
	|ГДЕ
	|	НЕ &ПоМНН
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втСловаСЗаполненнымФонетическимКодом.NumWord) >= &КоличествоСлов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	КОЛИЧЕСТВО(Слова.NumWord) КАК NumWord
	|ПОМЕСТИТЬ втНайденныеМНН
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МНН КАК МННСправочник
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Слова КАК Слова
	|			ПО (МННСправочник.Наименование ПОДОБНО Слова.LikeWordМаска)
	|		ПО Номенклатура.МНН = МННСправочник.Ссылка
	|ГДЕ
	|	&ПоМНН
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Слова.NumWord) >= &КоличествоСлов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНайденныеБезМНН.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втНеАналоги
	|ИЗ
	|	втНайденныеБезМНН КАК втНайденныеБезМНН
	|
	|СГРУППИРОВАТЬ ПО
	|	втНайденныеБезМНН.Номенклатура
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втНайденныеМНН.Номенклатура
	|ИЗ
	|	втНайденныеМНН КАК втНайденныеМНН
	|
	|СГРУППИРОВАТЬ ПО
	|	втНайденныеМНН.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНеАналоги.Номенклатура КАК Номенклатура
//	|	втНеАналоги.Номенклатура.МНН КАК АналогДля
	|ИЗ
	|	втНеАналоги КАК втНеАналоги
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НоменклатураВся.Ссылка
//	|	НоменклатураВся.Ссылка.МНН
	|ИЗ
	|	втНеАналоги КАК втНеАналоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураВся
	|		ПО втНеАналоги.Номенклатура.МНН = НоменклатураВся.МНН
	|			И (втНеАналоги.Номенклатура.МНН <> ЗНАЧЕНИЕ(Справочник.МНН.ПустаяСсылка))
	|ГДЕ
	|	НЕ НоменклатураВся.Ссылка В
	|				(ВЫБРАТЬ
	|					втНеАналоги.Номенклатура
	|				ИЗ
	|					втНеАналоги КАК втНеАналоги)
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураВся.Ссылка
//	|	НоменклатураВся.Ссылка.МНН
	|";

	Запрос.УстановитьПараметр("ТЗ", ТаблицаПоиска);
	Запрос.УстановитьПараметр("КоличествоСлов", КоличествоСлов); 
	Запрос.УстановитьПараметр("ПоМНН", Ложь);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ТабТоваров.Загрузить(Результат.Выгрузить());
		Возврат Истина;

	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура НайтиТовар(Команда)

	НайтиТоварыСервере(СтрокаПоиска);

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.ТабТоваров.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбран товар", 15);
		Возврат;
	КонецЕсли; 
	
	ТоварВыбран = Истина;
	Закрыть(Элементы.ТабТоваров.ТекущиеДанные.Номенклатура);

КонецПроцедуры

&НаКлиенте
Процедура ТабТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Выбрать(Неопределено);

КонецПроцедуры
